Revit 2027 API
IFCUserDefinedPropertySet.CopyPropertySet Method
 Create copy of property set with new name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCUserDefinedPropertySet CopyPropertySet(
	Document document,
	string copyPropertySetName
)
Public Function CopyPropertySet (
	document As Document,
	copyPropertySetName As String
) As IFCUserDefinedPropertySet
public:
IFCUserDefinedPropertySet^ CopyPropertySet(
	Document^ document,
	String^ copyPropertySetName
)
member CopyPropertySet :
        document : Document *
        copyPropertySetName : string -> IFCUserDefinedPropertySet
Parameters
document Document
 The Revit document to save the copied property set.
copyPropertySetName String
 The name for copied property set name.
Return Value
IFCUserDefinedPropertySet
 The copied property set element.
Exceptions
Exception | Condition
ArgumentException |  The name is empty or already exists.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create IFCUserDefinedPropertySet element.
Remarks
 The copied property set is saved in the document passed as parameter. Passing the same document as the source property set's document will create a new property set in the same document.
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace